app/views/users/show.html.erb

            <li class="list-group-item text-right"><span class="pull-left"><strong class="">Real name</strong></span><%= @user.name %></li>
            <li class="list-group-item text-right"><span class="pull-left"><strong class="">Events Attended: </strong></span><%= @user.events.length %></li>
---
SELECT "events".* FROM "events" INNER JOIN "attendings" ON "events"."id" = "attendings"."event_id" WHERE "attendings"."user_id" = $1  [["user_id", 1]]