app/views/events/index.html.erb

SELECT  "tags".* FROM "tags" INNER JOIN "event_tags" ON "tags"."id" = "event_tags"."tag_id" WHERE "event_tags"."event_id" = $1 AND (tag_id = '0') ORDER BY "tags"."id" ASC LIMIT $2  [["event_id", 6], ["LIMIT", 1]]
---
                          <h3> <%= value.name %> </h3>
                          <p> Sport: <%= value.tags.where("tag_id = ?", "#{value.type_of_sport}").first.value %> </p>

SELECT "attendings".* FROM "attendings" WHERE "attendings"."event_id" = $1  [["event_id", 6]]
---
                            <% counter = 1 %>
                            <% elsif y == value.attendings.length - 1 && counter == 0%>