app/views/events/new.html.erb

SELECT "tags".* FROM "tags" WHERE (tag_category_id = 0)
---

          <%= p.collection_select :region, Tag.where("tag_category_id = ?", 0), :id, :value, label: 'Region' %>