app/views/events/show.html.erb

        <h3><%= link_to "Attendees", users_path(:search => @event.attendings.pluck(:user_id)) %></h3>
        <% @event.attendings.each do | value | %>
        <% User.all.where(id: value.user_id).first(5).each do | listuser | %>
---
SELECT "attendings".* FROM "attendings" WHERE "attendings"."event_id" = $1  [["event_id", 5]]
SELECT "users".* FROM "users" INNER JOIN "attendings" ON "users"."id" = "attendings"."user_id" WHERE "attendings"."event_id" = $1 AND "users"."id" = $2  [["event_id", 5], ["id", 2]]

        <h1><%= @event.name %></h1>
        <% @event.tags.where(id: @event.type_of_sport).each do |sport| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "event_tags" ON "tags"."id" = "event_tags"."tag_id" WHERE "event_tags"."event_id" = $1 AND "tags"."id" = $2  [["event_id", 2], ["id", 53]]