app/controllers/attendings_controller.rb

INSERT INTO "attendings" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["event_id", 2], ["created_at", 2017-02-15 16:16:18 UTC], ["updated_at", 2017-02-15 16:16:18 UTC]]
---
  def join
    @attending = Attending.new
    @attending.event_id = params[:id]
    @attending.user_id = current_user.id
    if @attending.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "attendings".* FROM "attendings" WHERE "attendings"."event_id" = $1 AND "attendings"."user_id" = $2 LIMIT $3  [["event_id", 5], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "attendings" WHERE "attendings"."id" = $1  [["id", 7]]
---
  def leave
    @event = Event.find_by_id(params[:id])
    if @event.user_id == current_user.id
      if Attending.where(event_id: params[:id]).where.not(user_id: current_user.id).length == 0
        Event.find_by_id(params[:id]).destroy
        flash[:success] = "Left the event successfully!"
        redirect_to events_path
      else
        @event.user_id = Attending.where(event_id: params[:id]).where.not(user_id: current_user.id).first.user_id
        @event.save
        Attending.where(event_id: params[:id]).find_by_user_id(current_user.id).destroy