app/controllers/comments_controller.rb

INSERT INTO "comments" ("message", "event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["message", "hshd\r\n"], ["event_id", 5], ["user_id", 1], ["created_at", 2017-02-16 07:50:42 UTC], ["updated_at", 2017-02-16 07:50:42 UTC]]
---
  def create
    @comment = @event.comments.create(params[:comment].permit(:message))

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def find_event
    @event = Event.find(params[:event_id])