app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (region = '1') AND (region = '1') AND (region = '1') AND (region = '1')
SELECT  "events".* FROM "events" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 4]]
SELECT "events".* FROM "events"
---
  def index
    if current_user == nil
      if params[:date]
        @latestevents = Event.where("date >= ?", params[:date]).first(4)
        @myevents = nil

      else
        @latestevents = Event.all.order('created_at DESC').first(4)
        @myevents = nil
      end
    else
      # if params[:date]
      #   @latestevents = Event.all.where.not(user_id: current_user.id).where("date >= ?", params[:date]).order('created_at DESC').first(4)
      #
      # else
      #   @latestevents = Event.all.where.not(user_id: current_user.id).order('created_at DESC').first(4)
      # end
      @latestevents = Event.all

SELECT  "events".* FROM "events" WHERE ("events"."user_id" != $1) AND (date >= '2017-02-15') ORDER BY created_at DESC LIMIT $2  [["user_id", 1], ["LIMIT", 4]]
---

      # line 27 not supposed to be there
        # @latestevents = Event.all.where.not(user_id: current_user.id).order('created_at DESC').first(4)
        @myevents = Event.all.where(user_id: current_user.id).order('created_at DESC').first(4)

INSERT INTO "events" ("user_id", "name", "description", "location", "type_of_sport", "date", "time", "duration", "minpax", "maxpax", "created_at", "updated_at", "region") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
INSERT INTO "event_tags" ("tag_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_id", 1], ["event_id", 7], ["created_at", 2017-02-15 13:44:38 UTC], ["updated_at", 2017-02-15 13:44:38 UTC]]
---
  def create
    @event = Event.new(event_params)
    @event.user_id = current_user.id

    if @event.save
      EventTag.create(tag_id: @event.region, event_id: @event.id)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = 6 ORDER BY created_at DESC
---
  def show
    @event = Event.find_by_id(params[:id])
    @comments = Comment.where(event_id: @event).order("created_at DESC")

SELECT "events".* FROM "events" ORDER BY created_at DESC
SELECT "events".* FROM "events" WHERE ("events"."user_id" != $1) ORDER BY created_at DESC  [["user_id", 1]]
SELECT "tags".* FROM "tags"
---
  def list
    if current_user == nil
      @event = Event.all.order('created_at DESC')
      @check = 0
    else
      @event = Event.all.where.not(user_id: current_user.id).order('created_at DESC')
      @check = 0
    end
    @tag = Tag.all

SELECT "attendings"."event_id" FROM "attendings" WHERE ("attendings"."user_id" != $1)  [["user_id", 1]]
SELECT "events".* FROM "events" WHERE ("events"."user_id" != $1) AND ("events"."event_id" NOT IN (1, 3, 4, 6)) ORDER BY created_at DESC  [["user_id", 1]]
SELECT "tags".* FROM "tags"
---
  def recommend
    @filter = Attending.all.where(user_id: current_user.id).select(:event_id).pluck(:event_id)
    @event = Event.all.where.not(user_id: current_user.id, id: @filter).order('created_at DESC')
    @tag = Tag.all