app/controllers/followings_controller.rb

  def create
    @following = Following.new(user_id: current_user.id, follower_id: following_params[:follower_id])

    if @following.save
---
INSERT INTO "followings" ("user_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["follower_id", 1], ["created_at", 2017-02-16 10:07:46 UTC], ["updated_at", 2017-02-16 10:07:46 UTC]]

  def destroy
    follow = Following.where(id: params[:id])[0]

    follow.destroy
---
SELECT "followings".* FROM "followings" WHERE "followings"."id" = $1  [["id", 1]]
DELETE FROM "followings" WHERE "followings"."id" = $1  [["id", 1]]