app/controllers/users_controller.rb

SELECT  "followings".* FROM "followings" WHERE 1=0 AND "followings"."user_id" = $1 ORDER BY "followings"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def index


    if current_user
      @users = User.where(["first_name LIKE ?", "%#{params[:search]}%"]).where.not(id: current_user.id)
      @users += User.where(["email LIKE ?", "%#{params[:search]}%"]).where.not(id: current_user.id)
      @users += User.where(["name LIKE ?", "%#{params[:search]}%"]).where.not(id: current_user.id)

      @usersfilter = @users.pluck(:id)
      @follow = Following.where(:follower_id => @usersfilter, :user_id => current_user.id) #produces an array of entries of people the current user is following
      @hash_of_follower_id_and_follow_id = Hash[@follow.map{ |c| [c.follower_id, c.id] }]