app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (first_name LIKE '%test%')
SELECT "users"."id" FROM "users" WHERE (first_name, email, name, id LIKE '%2%') AND (email LIKE '%2%') AND (name LIKE '%2%') AND "users"."id" = $1 AND ("users"."id" != $2)  [["id", 2], ["id", 1]]
SELECT  "followings".* FROM "followings" WHERE "followings"."follower_id" IN (2, 1) AND "followings"."user_id" = $1 ORDER BY "followings"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT DISTINCT "users"."id" FROM "users" WHERE (first_name, email, name, id LIKE '%2%') AND (email LIKE '%2%') AND (name LIKE '%2%') AND "users"."id" = $1 AND ("users"."id" != $2)  [["id", 2], ["id", 1]]
SELECT "events".* FROM "events" WHERE "events"."name" = $1  [["name", "Durian"]]
SELECT "events".* FROM "events" WHERE "events"."user_id" = $1  [["user_id", 2]]
SELECT DISTINCT "events".* FROM "events" WHERE "events"."name" = $1  [["name", ""]]
---
  def index
    if current_user != nil
      @users = User.where(["first_name LIKE ?", "%#{params[:search]}%"]).where.not(id: current_user.id)
      @users += User.where(["email LIKE ?", "%#{params[:search]}%"]).where.not(id: current_user.id)
      @users += User.where(["name LIKE ?", "%#{params[:search]}%"]).where.not(id: current_user.id)
      @users += User.where(id: params[:search]).where.not(id:current_user.id)
      @users = @users.uniq
      @usersfilter = @users.pluck(:id)
      @usersfilter = @usersfilter.uniq
      @follow = Following.where(:follower_id => @usersfilter, :user_id => current_user.id).first
      @following = Following.new
    else
      @users = User.where(["first_name LIKE ?", "%#{params[:search]}%"])
      @users += User.where(["email LIKE ?", "%#{params[:search]}%"])
      @users += User.where(["name LIKE ?", "%#{params[:search]}%"])
      @users += User.where(id: params[:search])
      @users = @users.uniq
      @usersfilter = @users.pluck(:id)
      @usersfilter = @usersfilter.uniq
      @follow = Following.where(:follower_id => @usersfilter).first
      @following = Following.new
    end
    @events = Event.where(name: params[:search])
    @events += Event.where(user_id: params[:search])
    @events = @events.to_a.uniq

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "followings".* FROM "followings" WHERE "followings"."follower_id" = $1 AND "followings"."user_id" = $2 ORDER BY "followings"."id" ASC LIMIT $3  [["follower_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
  def show

    @user = User.find_by_id(params[:id])
    #to see if truthie or falsie -> if current user already follow
    @follow = Following.where(:follower_id => params[:id], :user_id => current_user.id).first

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "huh?"], ["updated_at", 2017-02-15 15:19:57 UTC], ["id", 1]]
---
  def update
   @user = User.find(current_user.id)
   name = user_params["name"]
   value = user_params["value"]
   @user.update(name => value)